Tekla Open API Reference for Tekla Structures 2025
AnalysisModelGeneralProperties.ModalAnalysisModel Property
 Defines whether the modal analysis properties are used instead of the static load combinations.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool ModalAnalysisModel { get; set; }
Public Property ModalAnalysisModel As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisModelGeneralProperties Class
Tekla.Structures.Analysis Namespace